{
  // WebDAV Engine configuration options.
  "DavEngineOptions": {

    // License to activate WebDAV Engine. If no license is specified the WebDAV Engine will be activated
    // automatically via internet and will function for 5 days. The Engine will stop working after that.
    // To enable a 1-month trial period, download a trial license here https://www.webdavsystem.com/server/download/.
    "License": "",

    // Specifies whether the WebDAV shall use URIs with a domain name.
    // Some WebDAV clients including MS Mini-redirector does not support URIs without domain name.
    "UseFullUris": true,

    // Specifies whether XML written to the output will be formatted.
    "OutputXmlFormatting": true,

    // Enables or disables CORS for specified domain. If "*" is specified, CORS will be enabled for in all domains.
    "CorsAllowedFor": "*"
  },
  // WebDAV Context configuration options.
  "DavContextOptions": {
    // Files and folders in this folder become available via WebDAV.
    // The file system should support NTFS Alternate Data Streams (ADS) in case this sample is running on Windows
    // or Extended Attributes if this sample is running on OS X or Linux.
    // If ADS and Extended Attributes not supported configure AttrStoragePath options.
    // Make sure application has enough permissions to read, write and create files and folders in this folder.
    "RepositoryPath": "App_Data/WebDav/Storage",
    // By default locks and custom properties are stored in Alternate Data Streams (on Windows) or in Extended Attributes (on Linux and Mac),
    // together with a file. If ADS/Extended Attributes are not supported, this sample will try to store locks and
    // custom properties in system temp folder. To specify a location where the locks and custom properties should be stored
    // uncomment the following attribute and specify the folder path. Every attribute will be stored in a separate file under this folder
    // in this case.
    // "AttrStoragePath": "App_Data/WebDav/Storage/Attributes/"
  },

  // WebDAV Logger configuration options.
  "DavLoggerOptions": {

    // Log file path. Make sure the application has enough permissions to create files in the folder
    // where the log file is located - the application will rotate log files in this folder.
    // In case you experience any issues with WebDAV, examine this log file first and search for exceptions and errors.
    "LogFile": "App_Data/WebDav/Logs/WebDAVlog.txt",

    // Defines whether debug logging mode is enabled.
    "IsDebugEnabled": true
  },
  // This sections is used for storing user names/passwords
  "DavUsers": {
    "Users": [
      {
        "UserName": "User1",
        "Email": "user1@email.com",
        "Password": "pwd"
      },
      {
        "UserName": "User2",
        "Email": "user2@email.com",
        "Password": "pwd"
      }
    ]
  }
}
