{
  // WebDAV Engine configuration.
  "WebDAVEngine": {

    // License to activate WebDAV Engine. If no license is specified Engine will be activated
    // automatically via internet and will function for 5 days. Engine will stop working after that.
    // To enable a 1-month trial period, download a trial license here https://www.webdavsystem.com/server/download/.
    "License": "",

    // Enables or disables CORS for specified domain. If "*" is specified, CORS will be enabled for in all domains.
    "CorsAllowedFor": "*",

    // Specifies whether the WebDAV Engine shall use URIs with a domain name.
    // Some WebDAV clients including MS Mini-redirector does not support URIs without domain name.
    "UseFullUris": true
  },

  // GSuite Engine configuration.
  "GSuiteEngine": {

    // License to activate GSuite Engine. If no license is specified the GSuite Engine will be activated
    // automatically via internet and will function for 5 days. The Engine will stop working after that.
    // To enable a 1-month trial period, download a trial license here https://www.webdavsystem.com/server/download/.
    "License": "",

    // Specifies whether the GSuite shall use URIs with a domain name.
    // Some GSuite clients including MS Mini-redirector does not support URIs without domain name.
    "UseFullUris": true,

    // Enables or disables CORS for specified domain. If "*" is specified, CORS will be enabled for in all domains.
    "CorsAllowedFor": "*",

    // Google Service Account ID (client_email field from JSON file).
    // See how to create a service account and a private key here: https://www.webdavsystem.com/server/gsuite/service-account/
    "GoogleServiceAccountID": "",

    // Google Service private key (private_key field from JSON file).
    "GoogleServicePrivateKey": "",

    // Relative Url of "Webhook" callback. It handles the API notification messages that are triggered when a resource changes.
    "GoogleNotificationsRelativeUrl": "/GNotifications"
  },

  // WebDAV and G Suite Context configuration.
  "Context": {

    // Files and folders in this folder become available via WebDAV.
    // The file system should support NTFS Alternate Data Streams (ADS) in case this sample is running on Windows
    // or Extended Attributes if this sample is running on OS X or Linux.
    // If ADS and Extended Attributes not supported configure AttrStoragePath.
    // Make sure application has enough permissions to read, write and create files and folders in this folder.
    "RepositoryPath": "App_Data/WebDav/Storage",

    // By default locks and custom properties are stored in Alternate Data Streams (on Windows) or in Extended Attributes (on Linux and Mac),
    // together with a file. If ADS/Extended Attributes are not supported, this sample will try to store locks and
    // custom properties in system temp folder. To specify a location where the locks and custom properties should be stored
    // uncomment the following attribute and specify the folder path. Every attribute will be stored in a separate file under this folder
    // in this case.
    // "AttrStoragePath": "App_Data/WebDav/Storage/Attributes/"

    // File system search provider. This provider is available on Windows Vista and later versions as well as on Window Server 2008.
    // It is not available on Web-editions of Windows Server OS by default.
    // To get search results file system indexing on the folder that contains documents (storage folder) must be enabled.
    //To find how to enable indexing follow this link: http://windows.microsoft.com/en-us/windows/improve-windows-searches-using-index-faq 
    "WindowsSearchProvider": "Provider=Search.CollatorDSO;Extended Properties='Application=Windows';"
  },

  // Logger configuration.
  "Logger": {

    // Log file path. Make sure the application has enough permissions to create files in the folder
    // where the log file is located - the application will rotate log files in this folder.
    // In case you experience any issues, examine this log file first and search for exceptions and errors.
    "LogFile": "App_Data/WebDav/Logs/WebDAVlog.txt",

    // Defines whether debug logging mode is enabled.
    "IsDebugEnabled": true
  },

  // This sections is used for storing user names/passwords
  "Users": {
    "Users": [
      {
        "UserName": "User1",
        "Email": "user1@email.com",
        "Password": "pwd"
      },
      {
        "UserName": "User2",
        "Email": "user2@email.com",
        "Password": "pwd"
      }
    ]
  },
}
